In [2]:
import pandas as pd
import numpy as np

In [3]:
# Creation of dataframes in pandas
data={
    "Name":["ali","yasir","sharjeel"],
    "Age":[10,20,30]
}
df=pd.DataFrame(data)
df

       Name  Age
0       ali   10
1     yasir   20
2  sharjeel   30

In [ ]:
# For datasets
data=pd.read_csv("titanic.csv")
data

In [9]:
# Exploring data in pandas  
    # we have to know the complete knowledge regarding data(null val,num val,datatype)
data=pd.read_csv("titanic.csv")
data.info()
data.describe()
data.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   last      891 non-null    object
 1   first     891 non-null    object
 2   gender    891 non-null    object
 3   age       714 non-null    float64
 4   class     891 non-null    int64
 5   fare      891 non-null    float64
 6   embarked  891 non-null    object
 7   survived  891 non-null    object
dtypes: float64(2), int64(1), object(5)
memory usage: 55.8+ KB

last          0
first         0
gender        0
age         177
class         0
fare          0
embarked      0
survived      0
dtype: int64

In [14]:
#Handling Duplicate value in pandas
data=pd.read_csv("titanic.csv")
data.duplicated()
data['age'].duplicated().sum()

# we have to remove the duplicated values from there where we have unique values 

data.drop_duplicates("age")

,last,first,gender,age,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22.00,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.00,1,71.2833,Cherbourg,yes
2,Heikkinen,Miss Laina,F,26.00,3,7.9250,Southampton,yes
3,Futrelle,Mrs. Jacques Heath (Lily May Peel),F,35.00,1,53.1000,Southampton,yes
5,Moran,Mr. James,M,NaN,3,8.4583,Queenstown,no
...,...,...,...,...,...,...,...,...
755,Hamalainen,Master Viljo,M,0.67,2,14.5000,Southampton,yes
767,Mangan,Miss Mary,F,30.50,3,7.7500,Queenstown,no
803,Thomas,Master Assad Alexander,M,0.42,3,8.5167,Cherbourg,yes
843,Lemberopolous,Mr. Peter L,M,34.50,3,6.4375,Cherbourg,no
851,Svensson,Mr. Johan,M,74.00,3,7.7750,Southampton,no

In [ ]:
#Working with Missing values in Data
data=pd.read_csv("titanic.csv")
data.isnull().sum()
data.dropna()  # here if we do this then we cat see the record because it deletes all the record of user
data.replace(np.nan,"hi") #but it will replace all an with hi so we have to do this
print(data["age"].mean()) #so here we take the mean of age and now we will replace it with the nan value
data["age"]=data["age"].replace(np.nan,29.69)
data

In [22]:
#Agar ma uor ki value necha khali jga pr fill krwana chta ho ya
#  phr necha ki value upr fill krwana chhta to forward and bacword fill ka use kreinga
data.fillna(method="bfill")
data.filna(method="ffill")
data.ffill()

In [ ]:
# Coloumns Transformation in Pandas part 1
data=pd.read_csv("titanic.csv")
data.loc[df["ages"]